# -*- coding: utf-8 -*-
"""
Created on Thu Mar 23 18:30:26 2023

@author: USER
"""

"""
字串格式化 format

    %
        %d 十進制(十進位) 數字
        %s 字串
        %f 浮點數
    
    {}
        "{},{}".format(取代值1,取代值2...)
        "{0},{1},{0}".format(取代值0,取代值1) 值可重複被使用 
        
    

"""

# %
print("姓名：%s，零用錢有：%d" % ("Bill", 1000))
print("利率：%f" % (3.14)) # 預設保留6個小數點
print("利率：%.2f" % (3.1415926) )

print("姓名：%10s。" % ("Bill")) # 預設向右對齊，長度為10，不足處補空格
print("姓名：%-10s。" % ("Bill")) # -  為向左對齊，長度為10，不足處補空格
print("存款：%6d" % (1000))
print("存款：% 5.1f" % (3.14)) # 長度最小為5，不足處補空白，.1f 取一個小數位



# {}
# 取代值照順序寫
print("姓名：{}，存款：{}，銀行利率：{}".format("David",100000,3.14))
# 取代值一索引值位置取代
print("電腦補習班：{0}，人數有：{1}，招生高是：{0}".format("聯成",100))

# {:,} :-> 位置； , -> 數字格式加上
print("現金有；{:,}，利率：{:.2f}".format(100000,3.1415))

# {1:3d} 1 -> 起始值位置；3->長度
print("人數有：{1:3d}，位置在：{0:10s}，分數為：{1:3d}".format("一中街",96))
print("人數有：{1:3d}，位置在：{0:<10s}，分數為：{1:3d}".format("一中街",96))
print("人數有：{1:3d}，位置在：{0:>10s}，分數為：{1:3d}".format("一中街",96))
print("人數有：{1:3d}，位置在：{0:^10s}，分數為：{1:3d}".format("一中街",96))

# {1:0>5d} 0-> 空白處補0，預設為空格；5->長度；> ->向右對齊； < ->向左對齊
print("人數有：{1:0>5d}，位置在：{0:^10s}，分數為：{1:3d}".format("一中街",96))
print("人數有：{1:+<5d}，位置在：{0:^10s}，分數為：{1:3d}".format("一中街",96))



