# -*- coding: utf-8 -*-
"""
Created on Thu Mar 23 19:08:31 2023

@author: USER
"""

print("姓名：{},存款：{}，銀行利率：{}".format("Bill",100000,3.14))

print("電腦補習班：{0}，員工人數有：{1}，招生高：{0}".format("聯成",100))


print("現金有：{:,}，利率：{:.2f}".format(100000,3.1415))

print("人數有：{1:3d}，位置在：{0:10s}，分數有：{1:3d}".format("一中街",96))

print("人數有：{1:3d}，位置在：{0:<10s}，分數有：{1:3d}".format("一中街",96))

print("人數有：{1:3d}，位置在：{0:>10s}，分數有：{1:3d}".format("一中街",96))

print("人數有：{1:3d}，位置在：{0:^10s}，分數有：{1:3d}".format("一中街",96))



print("人數有：{1:0>5d}，位置在：{0:^10s}，分數有：{1:3d}".format("一中街",96))
print("人數有：{1:+<5d}，位置在：{0:^10s}，分數有：{1:3d}".format("一中街",96))

